app/Controllers/Berkas.php

SELECT *
FROM `berkas`
---
    public function index()
    {
		$berkas = new BerkasModel();
		$data['berkas'] = $berkas->findAll();

SELECT *
FROM `berkas`
---
	public function kumpulan()
    {
		$berkas = new BerkasModel();
		$data['berkas'] = $berkas->findAll();

INSERT INTO `berkas` (`berkas`, `keterangan`, `title`) VALUES ('1689648137_6c383878a4b9f2723f88.zip', 'ini adalah zip', 'e-voting firmware')
---
		$berkas = new BerkasModel();
		$dataBerkas = $this->request->getFile('berkas');
		$fileName = $dataBerkas->getRandomName();
		$berkas->insert([
			'berkas' => $fileName,
			'keterangan' => $this->request->getPost('keterangan'),
			'title' => $this->request->getPost('title')
		]);